prst/TM4C1294/blinky.c
		case 2:
		case '2':
			GPIO_PORTK_DATA_R     &= ~(1<<2); // Cathod - A
			GPIO_PORTA_AHB_DATA_R &= ~(1<<4); // Cathod - B
			//GPIO_PORTK_DATA_R     |=  (1<<1); // Cathod - C
			GPIO_PORTB_AHB_DATA_R &= ~(1<<5); // Cathod - D
			GPIO_PORTB_AHB_DATA_R &= ~(1<<4); // Cathod - E
			//GPIO_PORTK_DATA_R     |=  (1<<3); // Cathod - F
			GPIO_PORTA_AHB_DATA_R &= ~(1<<5); // Cathod - G
			//GPIO_PORTK_DATA_R     |=  (1<<0); // Cathod - H
		break;

		case 3:
		case '3':
			GPIO_PORTK_DATA_R     &= ~(1<<2); // Cathod - A
			GPIO_PORTA_AHB_DATA_R &= ~(1<<4); // Cathod - B
			GPIO_PORTK_DATA_R     &= ~(1<<1); // Cathod - C
			GPIO_PORTB_AHB_DATA_R &= ~(1<<5); // Cathod - D
			//GPIO_PORTB_AHB_DATA_R |=  (1<<4); // Cathod - E
			//GPIO_PORTK_DATA_R     |=  (1<<3); // Cathod - F
			GPIO_PORTA_AHB_DATA_R &= ~(1<<5); // Cathod - G
			//GPIO_PORTK_DATA_R     |=  (1<<0); // Cathod - H
		break;

		case 4:
		case '4':
			//GPIO_PORTK_DATA_R     |=  (1<<2); // Cathod - A
			GPIO_PORTA_AHB_DATA_R &= ~(1<<4); // Cathod - B
			GPIO_PORTK_DATA_R     &= ~(1<<1); // Cathod - C
			//GPIO_PORTB_AHB_DATA_R |=  (1<<5); // Cathod - D
			//GPIO_PORTB_AHB_DATA_R |=  (1<<4); // Cathod - E
			GPIO_PORTK_DATA_R     &= ~(1<<3); // Cathod - F
			GPIO_PORTA_AHB_DATA_R &= ~(1<<5); // Cathod - G
			//GPIO_PORTK_DATA_R     |=  (1<<0); // Cathod - H
		break;

		case 5:
		case '5':
			GPIO_PORTK_DATA_R     &= ~(1<<2); // Cathod - A
			//GPIO_PORTA_AHB_DATA_R |=  (1<<4); // Cathod - B
			GPIO_PORTK_DATA_R     &= ~(1<<1); // Cathod - C
			GPIO_PORTB_AHB_DATA_R &= ~(1<<5); // Cathod - D
			//GPIO_PORTB_AHB_DATA_R |=  (1<<4); // Cathod - E
			GPIO_PORTK_DATA_R     &= ~(1<<3); // Cathod - F
			GPIO_PORTA_AHB_DATA_R &= ~(1<<5); // Cathod - G
			//GPIO_PORTK_DATA_R     |=  (1<<0); // Cathod - H
		break;

		case 6:
		case '6':
			GPIO_PORTK_DATA_R     &= ~(1<<2); // Cathod - A
			//GPIO_PORTA_AHB_DATA_R |=  (1<<4); // Cathod - B
			GPIO_PORTK_DATA_R     &= ~(1<<1); // Cathod - C
			GPIO_PORTB_AHB_DATA_R &= ~(1<<5); // Cathod - D
			GPIO_PORTB_AHB_DATA_R &= ~(1<<4); // Cathod - E
			GPIO_PORTK_DATA_R     &= ~(1<<3); // Cathod - F
			GPIO_PORTA_AHB_DATA_R &= ~(1<<5); // Cathod - G
			//GPIO_PORTK_DATA_R     |=  (1<<0); // Cathod - H
		break;

		case 7:
		case '7':
			GPIO_PORTK_DATA_R     &= ~(1<<2); // Cathod - A
			GPIO_PORTA_AHB_DATA_R &= ~(1<<4); // Cathod - B
			GPIO_PORTK_DATA_R     &= ~(1<<1); // Cathod - C
			//GPIO_PORTB_AHB_DATA_R |=  (1<<5); // Cathod - D
			//GPIO_PORTB_AHB_DATA_R |=  (1<<4); // Cathod - E
			//GPIO_PORTK_DATA_R     |=  (1<<3); // Cathod - F
			//GPIO_PORTA_AHB_DATA_R |=  (1<<5); // Cathod - G
			//GPIO_PORTK_DATA_R     |=  (1<<0); // Cathod - H
		break;

		case 8:
		case '8':
			GPIO_PORTK_DATA_R     &= ~(1<<2); // Cathod - A
			GPIO_PORTA_AHB_DATA_R &= ~(1<<4); // Cathod - B
			GPIO_PORTK_DATA_R     &= ~(1<<1); // Cathod - C
			GPIO_PORTB_AHB_DATA_R &= ~(1<<5); // Cathod - D
			GPIO_PORTB_AHB_DATA_R &= ~(1<<4); // Cathod - E
			GPIO_PORTK_DATA_R     &= ~(1<<3); // Cathod - F
			GPIO_PORTA_AHB_DATA_R &= ~(1<<5); // Cathod - G
			//GPIO_PORTK_DATA_R     |=  (1<<0); // Cathod - H
		break;

		case 9:
		case '9':
			GPIO_PORTK_DATA_R     &= ~(1<<2); // Cathod - A
			GPIO_PORTA_AHB_DATA_R &= ~(1<<4); // Cathod - B
			GPIO_PORTK_DATA_R     &= ~(1<<1); // Cathod - C
			GPIO_PORTB_AHB_DATA_R &= ~(1<<5); // Cathod - D
			//GPIO_PORTB_AHB_DATA_R |=  (1<<4); // Cathod - E
			GPIO_PORTK_DATA_R     &= ~(1<<3); // Cathod - F
			GPIO_PORTA_AHB_DATA_R &= ~(1<<5); // Cathod - G
			//GPIO_PORTK_DATA_R     |=  (1<<0); // Cathod - H
		break;
	}

	if ( symbol==0x00 ) {
		//symbol = '.';
		//case '.':
			//GPIO_PORTK_DATA_R     |=  (1<<2); // Cathod - A
			//GPIO_PORTA_AHB_DATA_R |=  (1<<4); // Cathod - B
			//GPIO_PORTK_DATA_R     |=  (1<<1); // Cathod - C
			//GPIO_PORTB_AHB_DATA_R |=  (1<<5); // Cathod - D
			//GPIO_PORTB_AHB_DATA_R |=  (1<<4); // Cathod - E
			//GPIO_PORTK_DATA_R     |=  (1<<3); // Cathod - F
			//GPIO_PORTA_AHB_DATA_R |=  (1<<5); // Cathod - G
			GPIO_PORTK_DATA_R     &= ~(1<<0); // Cathod - H
		//break;
	}

	if (position==comma) { // Cathod - H
		GPIO_PORTK_DATA_R&=~(1<<0);
	}

	if (position==(0x30+comma)) { // Cathod - H
		GPIO_PORTK_DATA_R&=~(1<<0);
	}
}
//******************************************************************************



//******************************************************************************
void drv_led_8x8_pixel_set ( uint8_t x, uint8_t y, uint8_t t ) {
	GPIO_PORTC_AHB_DATA_R |=  (1<<4); // Cathod - X0
	GPIO_PORTC_AHB_DATA_R |=  (1<<5); // Cathod - X1
	GPIO_PORTC_AHB_DATA_R |=  (1<<6); // Cathod - X2
	GPIO_PORTE_AHB_DATA_R |=  (1<<5); // Cathod - X3
	GPIO_PORTE_AHB_DATA_R |=  (1<<0); // Cathod - X4
	GPIO_PORTE_AHB_DATA_R |=  (1<<1); // Cathod - X5
	GPIO_PORTE_AHB_DATA_R |=  (1<<2); // Cathod - X6
	GPIO_PORTE_AHB_DATA_R |=  (1<<3); // Cathod - x7
	switch ( x ) {
		case 0: GPIO_PORTC_AHB_DATA_R &= ~(1<<4); break; // Cathod - X0
		case 1: GPIO_PORTC_AHB_DATA_R &= ~(1<<5); break; // Cathod - X1
		case 2: GPIO_PORTC_AHB_DATA_R &= ~(1<<6); break; // Cathod - X2
		case 3: GPIO_PORTE_AHB_DATA_R &= ~(1<<5); break; // Cathod - X3
		case 4: GPIO_PORTE_AHB_DATA_R &= ~(1<<0); break; // Cathod - X3
		case 5: GPIO_PORTE_AHB_DATA_R &= ~(1<<1); break; // Cathod - X3
		case 6: GPIO_PORTE_AHB_DATA_R &= ~(1<<2); break; // Cathod - X5
		case 7:	GPIO_PORTE_AHB_DATA_R &= ~(1<<3); break; // Cathod - X6
		/*default:
			GPIO_PORTC_AHB_DATA_R |=  (1<<4); // Cathod - X0
			GPIO_PORTC_AHB_DATA_R |=  (1<<6); // Cathod - X1
			GPIO_PORTC_AHB_DATA_R |=  (1<<6); // Cathod - X2
			GPIO_PORTE_AHB_DATA_R |=  (1<<5); // Cathod - X3
			GPIO_PORTE_AHB_DATA_R |=  (1<<0); // Cathod - X4
			GPIO_PORTE_AHB_DATA_R |=  (1<<1); // Cathod - X5
			GPIO_PORTE_AHB_DATA_R |=  (1<<2); // Cathod - X6
			GPIO_PORTE_AHB_DATA_R |=  (1<<3); // Cathod - x7
		break;*/
	}


	/*case 0: */ GPIO_PORTM_DATA_R     &= ~(1<<4); //break; // Cathod - y0
	/*case 1: */ GPIO_PORTA_AHB_DATA_R &= ~(1<<6); //break; // Cathod - y1
	/*case 2: */ GPIO_PORTD_AHB_DATA_R &= ~(1<<3); //break; // Cathod - y2
	/*case 3: */ GPIO_PORTB_AHB_DATA_R &= ~(1<<2); //break; // Cathod - y3
	/*case 4: */ GPIO_PORTB_AHB_DATA_R &= ~(1<<3); //break; // Cathod - y4
	/*case 5: */ GPIO_PORTC_AHB_DATA_R &= ~(1<<7); //break; // Cathod - y5
	/*case 6: */ GPIO_PORTE_AHB_DATA_R &= ~(1<<4); //break; // Cathod - y6
	/*case 7: */ GPIO_PORTD_AHB_DATA_R &= ~(1<<7); //break; // Cathod - X7
	/* */
	/*case 8: */ GPIO_PORTD_AHB_DATA_R &= ~(1<<1); //break; // Cathod - y8
	/*case 9: */ GPIO_PORTP_DATA_R     &= ~(1<<2); //break; // Cathod - y9
	/*case 10:*/ GPIO_PORTD_AHB_DATA_R &= ~(1<<0); //break; // Cathod - y10
	/*case 11:*/ GPIO_PORTM_DATA_R     &= ~(1<<3); //break; // Cathod - y11
	/*case 12:*/ GPIO_PORTH_AHB_DATA_R &= ~(1<<2); //break; // Cathod - y12
	/*case 13:*/ GPIO_PORTH_AHB_DATA_R &= ~(1<<3); //break; // Cathod - y13
	/*case 14:*/ GPIO_PORTN_DATA_R     &= ~(1<<2); //break; // Cathod - y14
	/*case 15:*/ GPIO_PORTN_DATA_R     &= ~(1<<3); //break; // Cathod - X15

