prst/TM4C1294/blinky.c
    timer_leds5x8.timer_is_set = 1;
    timer_leds5x8.set_timer_limit  = 200; // set period for 5x8 7-segment display

    timer_count.timer_is_set = 1;
    timer_count.set_timer_limit  = 100; // set period for timer counter

    timer_keys_usr1_2.timer_is_set = 1;
    timer_keys_usr1_2.ready_to_use = 1;
    timer_keys_usr1_2.set_timer_limit  = 5000; // set period for 8x8 leds display
}
//******************************************************************************



//******************************************************************************
t_timer_stat delay_timer_count (uint8_t cfg) {
t_timer_stat err_code = _TIMER_NOT_READY;
	if (cfg==0) {
		timer_count.cur_timer_val=0;
	}

	if (cfg=='?') {
		if ( timer_count.timer_is_set ) {
			timer_count.cur_timer_val++;
			if ( timer_count.cur_timer_val >= timer_count.set_timer_limit ) {
				err_code = _TIMER_READY;
			} else {
				err_code = _TIMER_NOT_READY;
			}
		} else {
			err_code = _TIMER_NOT_READY;
		}
	}

	return err_code;
}
//******************************************************************************



//******************************************************************************
t_timer_stat delay_timer_keys_usr1_2 (uint8_t cfg) {
t_timer_stat err_code = _TIMER_NOT_READY;
	if (cfg==0) {
		timer_keys_usr1_2.cur_timer_val=0;
	}

	if (cfg=='?') {
		if ( timer_keys_usr1_2.timer_is_set ) {
			timer_keys_usr1_2.cur_timer_val++;
			if ( timer_keys_usr1_2.cur_timer_val >= timer_keys_usr1_2.set_timer_limit ) {
				err_code = _TIMER_READY;
			} else {
				err_code = _TIMER_NOT_READY;
			}
		} else {
			err_code = _TIMER_NOT_READY;
		}
	}

	return err_code;
}
//******************************************************************************



//******************************************************************************
t_timer_stat delay_timer_leds5x8 (uint8_t cfg) {
t_timer_stat err_code = _TIMER_NOT_READY;

	if (cfg==0) {
		timer_leds5x8.cur_timer_val=0;
	}

	if (cfg=='?') {
		if ( timer_leds5x8.timer_is_set ) {
			if ( ++timer_leds5x8.cur_timer_val >= timer_leds5x8.set_timer_limit ) {
				err_code = _TIMER_READY;
			} else {
				err_code = _TIMER_NOT_READY;
			}
		} else {
			err_code = _TIMER_NOT_READY;
		}
	}

	return err_code;
}
//******************************************************************************



//******************************************************************************
// Number in to string converter
//******************************************************************************
// itoa
char* IntToStr(int i, char b[]) {
    char const digit[] = "0123456789";
    char* p = b;
    if(i<0){
        *p++ = '-';
        i *= -1;
    }
    int shifter = i;
    do{ //Move to where representation ends
        ++p;
        shifter = shifter/10;
    }while(shifter);
    *p = '\0';
    do{ //Move back, inserting digits as u go
        *--p = digit[i%10];
        i = i/10;
    }while(i);
    return b;
}
//******************************************************************************



//******************************************************************************
// Number in to string converter
//******************************************************************************
// itoa
char* FloatToLeds5x8(float ff, char b[]) {
    char const digit[] = "0123456789";
    char *p = b;
    int shifter=0, i=0, pos=0, stepen=0, mux=0, in1=0;
    float ostatok;

    ostatok = ff-(int)ff;
    if (ostatok<0) ostatok*=-1;
    if (ostatok<0.0001) ostatok*=10000000;
    if (ostatok<0.001) ostatok*=1000000;
    if (ostatok<0.01) ostatok*=100000;
    if (ostatok<0.1) ostatok*=10000;
    if (ostatok<1) ostatok*=1000;

    i = ff;
    in1 = (int)ff;

	for (pos=0; pos<5; pos++) {
		switch (pos){
			case 0: mux=0; break;
			case 1: mux=10; break;
			case 2: mux=100; break;
			case 3: mux=1000; break;
			case 4: mux=10000; break;
			case 5: mux=100000; break;
		}
		for ( stepen=0; (uint16_t)(in1-(stepen*mux))<mux; stepen++ ) {
			if (stepen<pos) {
				b[pos]=stepen;
			}
		}
    }

    if (i<0) {
        *p++ = '-';
        i *= -1;
    }

    shifter = i;

    do { //Move to where representation ends
        ++p;
        shifter = shifter/10;
        *p = shifter;
    } while (shifter) ;

    //*p = '\0';
    *p = '.';

    do { //Move to where representation ends
        ++p;
        ostatok = ostatok/10;
        *p = ostatok;
    } while ((int)ostatok) ;

    do{ //Move back, inserting digits as u go
        *--p = digit[i%10];
        i = i/10;
    }while(i);

    return b;
}
//******************************************************************************



//******************************************************************************
char *ultostr(unsigned long value, char *ptr, int base)
{
  unsigned long t = 0, res = 0;
  unsigned long tmp = value;
  int count = 0;

  if (NULL == ptr) {
    return NULL;
  }

  if (tmp == 0) {
    count++;
  }

  while(tmp > 0) {
    tmp = tmp/base;
    count++;
  }

  ptr += count;
  *ptr = '\0';

  do {
    res = value - base * (t = value / base);
    if (res < 10) {
      * -- ptr = '0' + res;
    } else
    if ((res >= 10) && (res < 16)) {
        * --ptr = 'A' - 10 + res;
    }
  } while ((value = t) != 0);

  return(ptr);
}
//******************************************************************************



//******************************************************************************
char *ftostr(float value, char *p_string, int base, uint8_t *p_comma)
{
  unsigned long t=0;
  unsigned long res=0;
  unsigned long val=0;
  float         ostatok_float=0;
  uint32_t      celoe=0, ostatok_int=0;
  uint8_t       dlina_ostatka=0;

  if (NULL == p_string) {
    return NULL;
  }

  if (NULL == p_comma) {
    return NULL;
  }

  celoe = (int)value;
  ostatok_float = value - celoe;

