prst/TM4C1294/blinky.c
  if (celoe<1) {
	  *p_comma=0;
		ostatok_int = (uint32_t)((ostatok_float * 10000));
		dlina_ostatka = 5 - (*p_comma);
		p_string += 0;
  } else
  if (celoe<10) {
	  *p_comma=0;
		ostatok_int = (uint32_t)((ostatok_float * 10000));
		dlina_ostatka = 5 - (*p_comma+1);
		p_string += 1;
  } else
  if (celoe<100) {
	  *p_comma=1;
		ostatok_int = (uint32_t)((ostatok_float * 1000));
		dlina_ostatka = 5 - (*p_comma+1);
		p_string += 2;
  } else
  if (celoe<1000) {
	  *p_comma=2;
		ostatok_int = (uint32_t)((ostatok_float * 100));
		dlina_ostatka = 5 - (*p_comma+1);
		p_string += 3;
  } else
  if (celoe<10000) {
	  *p_comma=3;
		ostatok_int = (uint32_t)((ostatok_float * 10));
		dlina_ostatka = 5 - (*p_comma+1);
		p_string += 4;
  } else
  if (celoe<100000) {
	  *p_comma=4;
		ostatok_int = (uint32_t)((ostatok_float * 1));
		dlina_ostatka = 5 - (*p_comma+1);
		p_string += 5;
  } else
  if (celoe<1000000) {
	  *p_comma=4;
		ostatok_int = (uint32_t)((ostatok_float * 0));
		dlina_ostatka = 5 - (*p_comma+1);
		p_string += 6;
  }

  val = value;

  do {  // display - Celoe
	t = val / base;
    res = val - base * t; // res = drobnaya ot value
    if (res < 10) {
      *--p_string = '0' + res;
    }
  } while ((val = t) != 0);

  if (celoe<1) { p_string += 5;  }     else
  if (celoe<10) { p_string += 4; }     else
  if (celoe<100) { p_string += 4; }    else
  if (celoe<1000) { p_string += 4; }   else
  if (celoe<10000) { p_string += 4; }  else
  if (celoe<100000) { p_string += 4; } else
  if (celoe<1000000) { p_string += 4; }

  if (*p_comma<5) { // Display - Ostatok
	  do {
	    if (dlina_ostatka>0) {
			t = ostatok_int / base;
			res = ostatok_int - base * t; // res = drobnaya ot value
			if (res < 10) {
			  *p_string-- = '0' + res;
			}
	      dlina_ostatka--;
	    }
	  } while ( (ostatok_int=t)!=0 || dlina_ostatka!=0 );
  }

  return(p_string);
}
//******************************************************************************



//******************************************************************************
void scan_keys ( t_io_values *p_io )
{
	//if ( y_pos<16) { y_pos++; } else y_pos=0;

	if ( (GPIO_PORTJ_AHB_DATA_R & 0x03) == BTN_PCS_0 ) {
		if ( p_io->in<99999 )
		if ( p_io->in<1 ) p_io->in += 0.0001; else
		if ( p_io->in<10 ) p_io->in += 0.001; else
		if ( p_io->in<100 ) p_io->in += 0.01; else
		if ( p_io->in<1000 ) p_io->in += 0.1; else
		if ( p_io->in<10000 ) p_io->in +=  1;

		if ( ++p_io->x>7 ) p_io->x=0;
	}
	if ( (GPIO_PORTJ_AHB_DATA_R & 0x03) == BTN_PCS_1 ) {
		if ( p_io->in>0 )
		if ( p_io->in<1 ) p_io->in -= 0.0001; else
		if ( p_io->in<10 ) p_io->in -= 0.001; else
		if ( p_io->in<100 ) p_io->in -= 0.01; else
		if ( p_io->in<1000 ) p_io->in -= 0.1; else
		if ( p_io->in<10000 ) p_io->in -=  1;

		if ( ++p_io->y>15 ) p_io->y=0;
	}
}
//******************************************************************************


typedef enum {
	S_START_RANDOM = 0,
	S_BEGIN,
	S_MOVE,
	S_EAT_YES,
	S_EAT_NO,
	S_RANDOM,
	S_CHANGE_DIRECTION,
	S_BORDER_END
} algo_step;

//******************************************************************************
void algo_Snake ( t_io_values *p_io,  t_io_Snake *p_snake ) {
/*
 * ) Set startup values (Random?)
 * )     <--------------------------------------------------------------------.
 * ) Check direction, check border limit    <-------------------------------. |
 * ) Replase last-bit into position which before head (...now it head...!)  | |
 * ) If exist Eat-bit, enlarge for length                                   | |
 * ) ...If no, do jump to ----------------------------------------------------'
 * ) random                                                                 |
 * ) if border limits is OK, direction to left/right/up/down ---------------'
 * ) ...If border is limited ->End
 * )
 */

}
//******************************************************************************


char data[5] ={ 1,  3,  5,  7,  9 };
char datas[5]={'1','3','5','7','9'};

//******************************************************************************
// Blinks on the leds and indicator.
//******************************************************************************
int main (void) {
    volatile uint32_t   pos;
    volatile uint32_t   cnt=0;
    char       *tmp;
	char       *p_str;
    uint8_t     comma;
	t_io_values io;
	t_io_Snake  snake;

    drv_sys_init_gpio ();
    drv_usr_init_led_7segments ();
    drv_usr_init_led_8x8 ();
    drv_usr_init_scheduler_and_all_timers ();

    leds_position = 1;
    io.in = 0.0001; // Set to default value

	while(1) {  // Loop forever.
		if ( _TIMER_READY == delay_timer_count('?') ) {
			//io.in += 0.0001;
			delay_timer_count(0);
		}
		if ( _TIMER_READY == delay_timer_leds5x8('?') ) {
			if ( pos < 5 ) {
				p_str = ftostr ( io.in, data, 10, &comma ); // value, *ptr, base, *comma_possition
				drv_led_7segments_symbol ( pos, data[pos], comma ); // display info
				drv_led_7segments_position ( pos ); // dinamic switching
				drv_led_8x8_pixel_set ( io.x, io.y, 0 ); // display info
				pos++;
				cnt++;
				algo_Snake ( &io, &snake );
    		} else {
				pos = 0;
    		}
			delay_timer_leds5x8(0);
    	}
		drv_led_blink ();

		if (  _TIMER_READY == delay_timer_keys_usr1_2('?') ) {
			scan_keys ( &io );
			delay_timer_keys_usr1_2(0);
		}
    }
}
//******************************************************************************
